{"academicScholarship-positive-Scholarship done well, which includes-citing - source of information and knowledge (e.g., software, equations, data)":"checked","academicScholarship-positive-Scholarship done well, which includes-units - input and output numbers have units (e.g. N, kJ, m/s, Hz)":"checked","academicScholarship-positive-Writing and communication done well, which includes-sentences - clean, concise and clear (C^3)":"checked","academicScholarship-positive-Writing and communication done well, which includes-sentences - complete written when appropriate (e.g., within Markdown cells, docstrings, f-string)":"checked","academicScholarship-neutral-Scholarship done okay, but with a few issues in the following-citing - when possible cite peer-reviewed papers or academic books, not websites":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - logical ordering and mixture of markdown and code cells":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-code cells - good separation of encode ideas":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-markdown cells - good usage to communicate ideas, thoughts or workflow":"checked","codeFormatting-positive-Formatting done well, which includes-blank lines - consistent and good usage":"checked","codeFormatting-positive-Formatting done well, which includes-f-string - properly used":"checked","codeFormatting-positive-Formatting done well, which includes-indentation - consistent and with 4 spaces":"checked","codeFormatting-positive-Formatting done well, which includes-line length - properly done (i.e., not longer than 110 characters)":"checked","userDefinedFunctions-positive-Good use of the following-isolating ideas to user-defined functions":"checked","userDefinedFunctions-negative-Your user-defined functions had the following problems-docstring - none provided for specifying context and usage":"checked","userDefinedFunctions-negative-Your user-defined functions had the following problems-internal checks - none provided (e.g., 'if not isinstance')":"checked","userDefinedFunctions-negative-Your user-defined functions had the following problems-type hinting - none provided":"checked","general-positive-Overall, your work done on this assignment was-good":"checked","significantFigures-positive-The significant figures for your final numeric value(s) was-correct - good job!":"checked","academicScholarship-textarea":"You should reference your sources where they are used in the Notebook. Use [x] in the Text for this.","jupyterNotebooks-textarea":"I really liked the structure of your Notebook, but i think a table of contents would have been nice.\n","userDefinedFunctions-textarea":"You didn't use docstrings to explain what your functions do. You also didn't check if the User passed the right type nor did you typehint.","general-textarea":"Your notebook was ok, but id rather have seen you using a list to read all distances from and printing their corresponding energies with a loop. (You can use the zip function for that). ","evaluation-textbox":" General Feedback \n\n\nAcademic Scholarship (Citations and Writing):\n\nPositive:\n•  Scholarship done well, which includes:\n      - citing - source of information and knowledge (e.g., software, equations, data)\n      - units - input and output numbers have units (e.g. N, kJ, m/s, Hz)\n•  Writing and communication done well, which includes:\n      - sentences - clean, concise and clear (C^3)\n      - sentences - complete written when appropriate (e.g., within Markdown cells, docstrings, f-string)\n\nNeutral:\n•  Scholarship done okay, but with a few issues in the following:\n      - citing - when possible cite peer-reviewed papers or academic books, not websites\n\nAdditional Notes: \n  You should reference your sources where they are used in the Notebook. Use [x] in the Text for this.\n\n\nJupyter Notebooks:\n\nPositive:\n•  Notebook is done well, which includes the following:\n      - cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)\n      - cell structure - logical ordering and mixture of markdown and code cells\n      - code cells - good separation of encode ideas\n      - markdown cells - good usage to communicate ideas, thoughts or workflow\n\nAdditional Notes: \n  I really liked the structure of your Notebook, but i think a table of contents would have been nice.\n  \n\n\nCode Formatting:\n\nPositive:\n•  Formatting done well, which includes:\n      - blank lines - consistent and good usage\n      - f-string - properly used\n      - indentation - consistent and with 4 spaces\n      - line length - properly done (i.e., not longer than 110 characters)\n\n\nUser-defined Functions:\n\nPositive:\n•  Good use of the following:\n      - isolating ideas to user-defined functions\n\nNegative:\n•  Your user-defined functions had the following problems:\n      - docstring - none provided for specifying context and usage\n      - internal checks - none provided (e.g., 'if not isinstance')\n      - type hinting - none provided\n\nAdditional Notes: \n  You didn't use docstrings to explain what your functions do. You also didn't check if the User passed the right type nor did you typehint.\n\n\nGeneral Feedback:\n\nPositive:\n•  Overall, your work done on this assignment was:\n      - good\n\nAdditional Notes: \n  Your notebook was ok, but id rather have seen you using a list to read all distances from and printing their corresponding energies with a loop. (You can use the zip function for that). \n\n\n Assignment Specific Feedback \n\n\nSignificant Figures:\n\nPositive:\n•  The significant figures for your final numeric value(s) was:\n      - correct - good job!\n"}