{"academicScholarship-positive-Scholarship done well, which includes-citing - source of information and knowledge (e.g., software, equations, data)":"checked","academicScholarship-positive-Scholarship done well, which includes-citing - proper ordering within the written text (e.g., ...[1-2]...[3] and not ...[3-4]...[1]...)":"checked","academicScholarship-positive-Scholarship done well, which includes-units - input and output numbers have units (e.g. N, kJ, m/s, Hz)":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - logical ordering and mixture of markdown and code cells":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-code cells - good separation of encode ideas":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-markdown cells - good usage to communicate ideas, thoughts or workflow":"checked","codeFormatting-positive-Formatting done well, which includes-blank lines - consistent and good usage":"checked","codeFormatting-positive-Formatting done well, which includes-f-string - properly used":"checked","codeFormatting-positive-Formatting done well, which includes-imports - libraries were alphabetized":"checked","codeFormatting-positive-Formatting done well, which includes-imports - libraries were listed at the notebook's top":"checked","codeFormatting-positive-Formatting done well, which includes-indentation - consistent and with 4 spaces":"checked","codeFormatting-positive-Formatting done well, which includes-line length - properly done (i.e., not longer than 110 characters)":"checked","codeFormatting-positive-Formatting done well, which includes-naming - descriptive, human readable objects/variables naming":"checked","codeFormatting-positive-Formatting done well, which includes-spacing - consistent and correct usage":"checked","codeFormatting-positive-Formatting done well, which includes-writing - clean, concise and clearly (C^3) written code":"checked","userDefinedFunctions-positive-Good use of the following-docstring - providing context; stating what the function does":"checked","userDefinedFunctions-positive-Good use of the following-docstring - defining input objects":"checked","userDefinedFunctions-positive-Good use of the following-docstring - defining returned object(s)":"checked","userDefinedFunctions-positive-Good use of the following-isolating ideas to user-defined functions":"checked","userDefinedFunctions-positive-Good use of the following-optional parameters - nice idea to include them":"checked","userDefinedFunctions-positive-Good use of the following-type hinting":"checked","userDefinedFunctions-negative-Your user-defined functions had the following problems-internal checks - none provided (e.g., 'if not isinstance')":"checked","general-positive-Overall, your work done on this assignment was-excellent":"checked","significantFigures-positive-The significant figures for your final numeric value(s) was-correct - good job!":"checked","userDefinedFunctions-textarea":"You should have checked if the user passed the right type to your functions.","general-textarea":"You really did a very good job :)\nJust make sure to typecheck your functions.","evaluation-textbox":" General Feedback \n\n\nAcademic Scholarship (Citations and Writing):\n\nPositive:\n•  Scholarship done well, which includes:\n      - citing - source of information and knowledge (e.g., software, equations, data)\n      - citing - proper ordering within the written text (e.g., ...[1-2]...[3] and not ...[3-4]...[1]...)\n      - units - input and output numbers have units (e.g. N, kJ, m/s, Hz)\n\n\nJupyter Notebooks:\n\nPositive:\n•  Notebook is done well, which includes the following:\n      - cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)\n      - cell structure - logical ordering and mixture of markdown and code cells\n      - code cells - good separation of encode ideas\n      - markdown cells - good usage to communicate ideas, thoughts or workflow\n\n\nCode Formatting:\n\nPositive:\n•  Formatting done well, which includes:\n      - blank lines - consistent and good usage\n      - f-string - properly used\n      - imports - libraries were alphabetized\n      - imports - libraries were listed at the notebook's top\n      - indentation - consistent and with 4 spaces\n      - line length - properly done (i.e., not longer than 110 characters)\n      - naming - descriptive, human readable objects/variables naming\n      - spacing - consistent and correct usage\n      - writing - clean, concise and clearly (C^3) written code\n\n\nUser-defined Functions:\n\nPositive:\n•  Good use of the following:\n      - docstring - providing context; stating what the function does\n      - docstring - defining input objects\n      - docstring - defining returned object(s)\n      - isolating ideas to user-defined functions\n      - optional parameters - nice idea to include them\n      - type hinting\n\nNegative:\n•  Your user-defined functions had the following problems:\n      - internal checks - none provided (e.g., 'if not isinstance')\n\nAdditional Notes: \n  You should have checked if the user passed the right type to your functions.\n\n\nGeneral Feedback:\n\nPositive:\n•  Overall, your work done on this assignment was:\n      - excellent\n\nAdditional Notes: \n  You really did a very good job :)\n  Just make sure to typecheck your functions.\n\n\n Assignment Specific Feedback \n\n\nSignificant Figures:\n\nPositive:\n•  The significant figures for your final numeric value(s) was:\n      - correct - good job!\n"}