{"followingInstructions-negative-The instructions were not followed, which includes-name - not included at the top of the solution":"checked","academicScholarship-positive-Scholarship done well, which includes-units - input and output numbers have units (e.g. N, kJ, m/s, Hz)":"checked","academicScholarship-positive-Writing and communication done well, which includes-sentences - clean, concise and clear (C^3)":"checked","academicScholarship-positive-Writing and communication done well, which includes-sentences - complete written when appropriate (e.g., within Markdown cells, docstrings, f-string)":"checked","academicScholarship-negative-No citation of information sources-As a university student, you should be citing sources of knowledge. This is something that you will need to do for your thesis.":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-cell structure - logical ordering and mixture of markdown and code cells":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-code cells - good separation of encode ideas":"checked","jupyterNotebooks-positive-Notebook is done well, which includes the following-markdown cells - good usage to communicate ideas, thoughts or workflow":"checked","codeFormatting-positive-Formatting done well, which includes-blank lines - consistent and good usage":"checked","codeFormatting-positive-Formatting done well, which includes-imports - libraries were alphabetized":"checked","codeFormatting-positive-Formatting done well, which includes-imports - libraries were listed at the notebook's top":"checked","codeFormatting-positive-Formatting done well, which includes-indentation - consistent and with 4 spaces":"checked","codeFormatting-positive-Formatting done well, which includes-line length - properly done (i.e., not longer than 110 characters)":"checked","codeFormatting-positive-Formatting done well, which includes-naming - descriptive, human readable objects/variables naming":"checked","codeFormatting-positive-Formatting done well, which includes-spacing - consistent and correct usage":"checked","codeFormatting-positive-Formatting done well, which includes-writing - clean, concise and clearly (C^3) written code":"checked","codeFormatting-negative-The following format issues were present in your code-f-string - not used (e.g., print statements)":"checked","general-positive-Overall, your work done on this assignment was-very good":"checked","followingInstructions-textarea":"You did write your actual Name, but you need to give your SciProID","academicScholarship-textarea":"All Terms were explained clearly, but you did not have any sources to back up your knowledge.","jupyterNotebooks-textarea":"Commendable Notebookstructure. Everything is very clear and pleasent to read :)","codeFormatting-textarea":"Very clean code, but you did not use f-String","general-textarea":"You did very good on this assignment, but unfortunately you failed to include sources for your claims and did not use f-String to print your results.","evaluation-textbox":" General Feedback \n\n\nFollowing Instructions:\n\nNegative:\n•  The instructions were not followed, which includes:\n      - name - not included at the top of the solution\n\n\nAcademic Scholarship (Citations and Writing):\n\nPositive:\n•  Scholarship done well, which includes:\n      - units - input and output numbers have units (e.g. N, kJ, m/s, Hz)\n•  Writing and communication done well, which includes:\n      - sentences - clean, concise and clear (C^3)\n      - sentences - complete written when appropriate (e.g., within Markdown cells, docstrings, f-string)\n\nNegative:\n•  No citation of information sources:\n      - As a university student, you should be citing sources of knowledge. This is something that you will need to do for your thesis.\n\nAdditional Notes: \n  All Terms were explained clearly, but you did not have any sources to back up your knowledge.\n\n\nJupyter Notebooks:\n\nPositive:\n•  Notebook is done well, which includes the following:\n      - cell structure - good usage to separate ideas (e.g., thoughts, tasks/subtasks, user-defined functions)\n      - cell structure - logical ordering and mixture of markdown and code cells\n      - code cells - good separation of encode ideas\n      - markdown cells - good usage to communicate ideas, thoughts or workflow\n\nAdditional Notes: \n  Commendable Notebookstructure. Everything is very clear and pleasent to read :)\n\n\nCode Formatting:\n\nPositive:\n•  Formatting done well, which includes:\n      - blank lines - consistent and good usage\n      - imports - libraries were alphabetized\n      - imports - libraries were listed at the notebook's top\n      - indentation - consistent and with 4 spaces\n      - line length - properly done (i.e., not longer than 110 characters)\n      - naming - descriptive, human readable objects/variables naming\n      - spacing - consistent and correct usage\n      - writing - clean, concise and clearly (C^3) written code\n\nNegative:\n•  The following format issues were present in your code:\n      - f-string - not used (e.g., print statements)\n\nAdditional Notes: \n  Very clean code, but you did not use f-String\n\n\nGeneral Feedback:\n\nPositive:\n•  Overall, your work done on this assignment was:\n      - very good\n\nAdditional Notes: \n  You did very good on this assignment, but unfortunately you failed to include sources for your claims and did not use f-String to print your results.\n"}